### Contents
    01. Importing libraries and data
    02. Combining data
    03.Exporting data in pickle format

# 01. Importing libraries and data

In [6]:
#Importing pandas, numpy, os and dataset
import pandas as pd
import numpy as np
import os
path=r'C:\Users\Мунаввар\Desktop\bootcamps\Achievement 4\Instacart Basket Analysis'
df_ords_prior=pd.read_csv(os.path.join(path, '02 Data', 'Original Data','order_products__prior.csv'), index_col=False)
df_ords=pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data','orders_checked.csv'), index_col=False)

# 02. Combining data

In [5]:
#Check the dimensions of the imported dataframe.
df_ords_prior.shape

(32434489, 4)

In [10]:
df_ords.shape

(3421083, 8)

In [7]:
#Take a glance at both of your dataframes via the head() function.
df_ords_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [9]:
df_ords=df_ords.drop(columns=['Unnamed: 0.1', 'Unnamed: 0'])
df_ords.head()

,order_id,customer_id,eval_set,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,first_order
0,2539329,1,prior,1,2,8,NaN,True
1,2398795,1,prior,2,3,7,15.0,False
2,473747,1,prior,3,3,12,21.0,False
3,2254736,1,prior,4,4,7,29.0,False
4,431534,1,prior,5,4,15,28.0,False

In [11]:
#Merging the dataframes
df_merged_large=df_ords.merge(df_ords_prior, on='order_id', indicator=True)
df_merged_large.head()

,order_id,customer_id,eval_set,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,prior,1,2,8,NaN,True,196,1,0,both
1,2539329,1,prior,1,2,8,NaN,True,14084,2,0,both
2,2539329,1,prior,1,2,8,NaN,True,12427,3,0,both
3,2539329,1,prior,1,2,8,NaN,True,26088,4,0,both
4,2539329,1,prior,1,2,8,NaN,True,26405,5,0,both

In [13]:
df_merged_large['_merge'].value_counts()

both          32434489
left_only            0
right_only           0
Name: _merge, dtype: int64

In [14]:
df_merged_large.shape

(32434489, 12)

In [16]:
df_merged_large['order_number'].isnull().sum()

0

# 03.Exporting data in pickle format

In [17]:
df_merged_large.to_pickle(os.path.join(path,'02 Data', 'Prepared Data', 'orders.products_combined.pkl'))